{
  "blogs": [
    {
      "title": "5 Tricks to Help Your Cat and Dog to Get Along",
      "body": "Typically, people claim that cats and dogs have always been enemies. However, there are many reasons to disregard this statement putting into consideration the fact that you will occasionally see them snuggling together and enjoying each other’s company. However, what we need to know is that the two animals speak different languages and getting them to be friends can be a real hassle!Do you want to help your cat and dog get along? Well…. Read on!First, you need to understand that cats are naturally aloof and get frightened easily. This is contrary to a dog that is gregarious and territorial and therefore wants to be the king of the jungle. Being indifferent does not necessarily mean that the two cannot live in the same place; all they need is your help to cope with one another. Luckily for you, this article will help your cat and dog live in harmony.Take personality into account rather than breed Many people hold strong beliefs that certain kinds of dogs or cats will never get along with the others no matter what you do. However, we should not let their origin blur us from seeing their real personality. Although some dogs are hard at bonding, you should familiarize yourself with which dog breeds are best with cats to avoid hard times in your home. What determines their level of bonding is its energy levels and temperament. This means that if you find an aggressive dog who wants to announce his territory, know that it is not the favorable breed to live with cats. Moreover, you will find an aging dog that prefers keeping his distance from kittens.From this, we can conclude that if your pet’s personality fails to match up with that of the other, you don’t have to force it. All you need to do is have a backup plan to ensure that your house arrangement keeps them separated for as long as possible.",
      "author": "sam",
      "id": 1
    },
    {
      "title": "Cat Twitching In Sleep",
      "body": "cats sleep in two ways: the light sleep and the deep sleep. A light cat sleep is when your cat stays alert and aware of its surroundings despite being asleep. A deep cat sleep is where most of the twitching happens – you will know that your cat is in this type of sleep if it suddenly moves its paws or whiskers, and it isn’t as easy to wake them up as in the light sleep.With that said, cats twitching in their sleep is pretty normal! So no worries there! But how normal is normal? Well, let us further delve into the details and find out more about its various meanings.",
      "author": "ram",
      "id": 2
    },
    {
      "title": "cvxcvxv",
      "body": "dsdvsdv",
      "author": "Sam",
      "id": 3
    }
  ]
}